danyanshuyu/Conveying-Line/CH563_UDP_CLIENT_师兄输送线课题/User/main.c
/********************************** (C) COPYRIGHT ******************************
* File Name          : main.c
* Author             : LN
* Version            : V1.0
* Date               : 2017/04/25
* Description        : 自动化运输线_带网络通讯模块_下位机逻辑动作控制器
*                      串口0输出监控信息,115200bps;
*******************************************************************************/

/******************************************************************************/
/* 头文件包含*/
#include <stdio.h>
#include <string.h>
#include "CH563SFR.H"
#include "SYSFREQ.H"
#include "CH563NET.H"
#include "ISPXT563.H"
#include "Extern_Variables.h"

#define CH563NET_DBG                      1    

/* 变量定义 */
volatile BUFF_UDP_DATA Buff_Tx;			                                        //从上位机接收的缓存数据
volatile UINT8 FirstBuf_Tx[1000];												//定义第一层数据发送缓冲区
UINT32  LENGH_TX = 0;														//数据处理后，Socket库函数发送给上位机所调用的字符长度
UINT16  EEPROM_CODE[512]; 		                                        //1024字节缓存，用于存放PLC代码，在RAM中运行



/* 函数声明 */
UINT8 Reverse(UINT8 a,UINT8 n );
void BarCode_Upload(UINT8 RcvNUM);
void SetOutput(UINT32 Value);
void PLC_PowerOn_Init();
void SendHandShake(UINT8 Last_IP);
void HandShakeSuccess();
void SendHeartbeatPacket();	
void SendDummy_Socket();
/*******************************************************************************
* Function Name  : Init_GPIO
* Description    : 为开关量输入输出初始化GPIO	(22+20+32)=74
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/

void Init_GPIO( void )
{
	/* GPIO  输入输出设置,0输入,1输出 */
    R8_PD_DIR_3 &= ~(1<<7);														//PD31 PB0~6,PB16~19 PD8~11为输入
    R8_PB_DIR_0 &= ~(0x7F);														//16位输入
	R8_PB_DIR_2 &= ~(0x0F);
	R8_PD_DIR_1 &= ~(0x0F);

	R8_PD_DIR_1 |= 0xF0;													    //PD12~15 PA0~3,PA4~7 PA12~15,PA8~11 PA16~17为输出
	R32_PA_DIR  |= 0x0003FFFF;														//22位输出

	/* GPIO  上拉设置,置1启用上拉,置0关闭上拉 */							   //下拉也可以，但不能浮空，未接入开关量时，数据容易受干扰而不断变化
	R8_PD_PU_3 |= 1<<7;													
	R8_PB_PU_0 |= 0x7F;                                                   
	R8_PB_PU_2 |= 0x0F;														
	R8_PD_PU_1 |= 0x0F;

	R8_PD_OUT_1 |= 0xF0;														//置1，高电平时输出无效
	R32_PA_OUT  |= 0x0003FFFF;

	/* ip的硬件输入，板子编号的硬件输入 */
	R8_PB_DIR_1 &= ~(0xF3);														//PB 8  9  12  13  14  15  PD 0  1			PD 2  3  4  5  6  7  
	R8_PD_DIR_0 &= ~(0xFF);														//SW 1  2  3   4   5   6      7  8			SW 9  10 11 12 13 14
	
	/* 下拉 */
//	R8_PB_PD_1 |= 0xF3;
//	R8_PD_PD_0 |= 0xFF;
}

/*******************************************************************************
* Function Name  : mInitSTDIO
* Description    : 为printf和getkey输入输出初始化串口
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/

void mInitSTDIO( void )
{
    UINT32    x, x2;

    x = 10 * FREQ_SYS * 2 / 16 / 115200;                                        /* 115200bps */
    x2 = x % 10;
    x /= 10;
    if ( x2 >= 5 ) x ++;                                                        /* 四舍五入 */
    R8_UART1_LCR = 0x80;                                                        /* DLAB位置1 */
    R8_UART1_DIV = 1;                                                           /* 预分频 */
    R8_UART1_DLM = x>>8;
    R8_UART1_DLL = x&0xff;

    R8_UART1_LCR = RB_LCR_WORD_SZ ;                                             /* 设置字节长度为8 */
    R8_UART1_FCR = RB_FCR_FIFO_TRIG|RB_FCR_TX_FIFO_CLR|RB_FCR_RX_FIFO_CLR |    
                   RB_FCR_FIFO_EN ;                                             /* 设置FIFO触发点为14，清发送和接收FIFO，FIFO使能 */
    R8_UART1_IER = RB_IER_TXD_EN;                                               /* TXD enable */
    R32_PB_SMT |= RXD1|TXD1;                                                    /* RXD0 schmitt input, TXD0 slow rate */
    R32_PB_PD &= ~ RXD1;                                                        /* disable pulldown for RXD0, keep pullup */
    R32_PB_DIR |= TXD1;                                                         /* TXD0 output enable */
}

/*******************************************************************************
* Function Name  : fputc
* Description    : 通过串口输出监控信息
* Input          : c-- writes the character specified by c 
*                  *f--the output stream pointed to by *f
* Output         : None
* Return         : None
*******************************************************************************/

int fputc( int c, FILE *f )
{
    R8_UART1_THR = c;                                                           /* 发送数据 */
    while( ( R8_UART1_LSR & RB_LSR_TX_FIFO_EMP ) == 0 );                        /* 等待数据发送 */
    return( c );
}


/*******************************************************************************
* Function Name  : Uart1_Init
* Description    : 串口1初始化
* Input          : baud-串口波特率，最高为主频1/8
* Output         : None
* Return         : None
*******************************************************************************/

void Uart1_Init( UINT32 baud )
{
    UINT32    x, x2;

    x = 10 * FREQ_SYS * 2 / 16 / baud;                                                /* 115200bps */
    x2 = x % 10;
    x /= 10;                                                                        
    if ( x2 >= 5 ) x ++; 															/* 四舍五入 */
    R8_UART1_LCR = RB_LCR_DLAB;                                                 /* DLAB位置1 */
    R8_UART1_DIV = 1;                                                           /* 预分频 */
    R8_UART1_DLM = x>>8;
    R8_UART1_DLL = x&0xff;

    R8_UART1_LCR = RB_LCR_WORD_SZ ;                                             /* 设置字节长度为8    */
    R8_UART1_FCR = RB_FCR_FIFO_TRIG|RB_FCR_TX_FIFO_CLR|RB_FCR_RX_FIFO_CLR |    
                   RB_FCR_FIFO_EN ;                                             /* 设置FIFO触发点为28，清发送和接收FIFO，FIFO使能 */
    R8_UART1_IER = RB_IER_TXD_EN | RB_IER_LINE_STAT |RB_IER_THR_EMPTY | 
                   RB_IER_RECV_RDY  ;                                           /* TXD enable */
    R8_UART1_MCR = RB_MCR_OUT2;                                                
    R8_INT_EN_IRQ_0 |= RB_IE_IRQ_UART1;                                            /* 串口中断输出使能 */
    R32_PB_SMT |= RXD1|TXD1;                                                    /* RXD1 schmitt input, TXD1 slow rate */
    R32_PB_PD  &= ~ RXD1;                                                       /* disable pulldown for RXD1, keep pullup */
    R32_PB_DIR |= TXD1;                                                         /* TXD1 output enable */
}

