danyanshuyu/Conveying-Line/CH563_UDP_CLIENT_师兄输送线课题/User/main.c
/*******************************************************************************
* Function Name  : UART1_SendByte
* Description    : 串口1发送一字节子程序
* Input          : dat -要发送的数据
* Output         : None
* Return         : None
*******************************************************************************/

void UART1_SendByte( UINT8 dat )   
{        
    R8_UART1_THR  = dat;
    while( ( R8_UART1_LSR & RB_LSR_TX_ALL_EMP ) == 0 );                         /* 等待数据发送 */       
}

/*******************************************************************************
* Function Name  : UART1_SendStr
* Description    : 串口1发送字符串子程序
* Input          : *str -要发送字符串的指针
* Output         : None
* Return         : None
*******************************************************************************/

void UART1_SendStr( UINT8 *str )   
{
    while( 1 ){
        if( *str == '\0' ) break;
        UART1_SendByte( *str++ );
    }
}

/*******************************************************************************
* Function Name  : UART1_RcvByte
* Description    : 串口1接收一字节子程序
* Input          : None
* Output         : None
* Return         : Rcvdat -接收到的数据
*******************************************************************************/

UINT8 UART1_RcvByte( void )    
{
    UINT8 Rcvdat = 0;
    
    if( !( ( R8_UART1_LSR  ) & ( RB_LSR_OVER_ERR |RB_LSR_PAR_ERR  | RB_LSR_FRAME_ERR |  RB_LSR_BREAK_ERR  ) ) ){
        while( ( R8_UART1_LSR & RB_LSR_DATA_RDY  ) == 0 );                      /* 等待数据准备好 */ 
        Rcvdat = R8_UART1_RBR;                                                  /* 从接收缓冲寄存器读出数据 */ 
    }
    else{
        R8_UART1_RBR;                                                           /* 有错误清除 */
    }
    return( Rcvdat );
}

/*******************************************************************************
* Function Name  : Seril1Send
* Description    : 串口1发送多字节子程序
* Input          : *Data -待发送数据区指针
*                  Num   -发送数据长度
* Output         : None
* Return         : None
*******************************************************************************/

void  Seril1Send( UINT8 *Data, UINT8 Num )                        
{
    do{
        while( ( R8_UART1_LSR & RB_LSR_TX_FIFO_EMP ) == 0 );                    /* 等待数据发送完毕 */ 
        R8_UART1_THR  = *Data++;  
    }while( --Num );
}

/*******************************************************************************
* Function Name  : Seril1Rcv
* Description    : 禁用FIFO,串口1接收多字节子程序
* Input          : *pbuf -接收缓冲区指针
* Output         : None
* Return         : RcvNum -接收到数据的数据长度
*******************************************************************************/

UINT8  Seril1Rcv( UINT8 *pbuf )    
{
    UINT8 RcvNum = 0;

    if( !( ( R8_UART1_LSR  ) & ( RB_LSR_OVER_ERR |RB_LSR_PAR_ERR  | RB_LSR_FRAME_ERR |  RB_LSR_BREAK_ERR  ) ) ){
        while( ( R8_UART1_LSR & RB_LSR_DATA_RDY  ) == 0 );                      /* 等待数据准备好 */ 
        do{
            *pbuf++ = R8_UART1_RBR;                                             /* 从接收缓冲寄存器读出数据 */ 
            RcvNum++;
        }while( ( R8_UART1_LSR & RB_LSR_DATA_RDY   ) == 0x01 );
    }
    else{
        R8_UART1_RBR;
    }
    return( RcvNum );
}

/*******************************************************************************
* Function Name  : UART1Send_FIFO
* Description    : 启用FIFO,一次最多32字节，CH432串口1发送多字节子程序
* Input          : *Data -待发送数据区指针
*                  Num   -发送数据长度
* Output         : None
* Return         : None
*******************************************************************************/

void UART1Send_FIFO( UINT8 *Data, UINT8 Num ) 
{
    int i;

    while( 1 ){
        while( ( R8_UART1_LSR & RB_LSR_TX_ALL_EMP ) == 0 );                     /* 等待数据发送完毕，THR,TSR全空 */
        if( Num <= 32){                                                         /* FIFO长度为32，数据长度不满32字节，一次发送完成 */
            do{
                R8_UART1_THR=*Data++;
            }while(--Num) ;
            break;
        }
        else{                                                                   /* FIFO长度为32，数据长度超过32字节，分多次发送，一次32字节 */
            for(i=0;i<32;i++){
                R8_UART1_THR=*Data++;
            }
            Num -= 32;
        }
    }
}

/*******************************************************************************
* Function Name  : CH563_EEPROM
* Description    : EEPROM操作子程序
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/

void CH563_EEPROM( void ) 
{

  //  CH563_EEPROM_ERASE(0x2000,0x1000);                                           //  擦除0X2000地址开始的4K数据 

  //  CH563_EEPROM_WRITE( 0x2000,my_buffer,64 );                                   //  往地址0X2000写64字节的数据
 
  //  CH563_EEPROM_READ( 0x2000,my_buffer,64 );                                    //  EEPROM读取地址0x2000数据，读取64字节 
 
}



/*******************************************************************************
* Function Name  : BarCode_Upload(RcvNum)
* Description    : 条形码数据上传给上位机
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void BarCode_Upload(UINT8 RcvNUM)
{
    UINT32 len;
    UINT32 totallen;
	UINT8  BarCode_Buff_Tx[50];
    UINT8 *p = BarCode_Buff_Tx;
	UINT16  LENGH;
	UINT16  T_IP = (IPAddr[3]>>8 | IPAddr[3]<<8);					// 发送的下位机IP的第四位
	BUFF_UDP_DATA Buff_Tx;			                                //发送给上位机的缓存数据
	UINT8 * P_Buff_Tx = (void *)&Buff_Tx;

	UINT8  DES_IP[4] = {192,168,1,100};                                         /* 目的IP地址 */
	UINT8  *ip = DES_IP;

	LENGH = RcvNUM+12;

	Buff_Tx.Start =	0xAA;
	Buff_Tx.Lengh = (LENGH>>8 | LENGH<<8);
	Buff_Tx.Packet_Flag = 0x0000;
	Buff_Tx.SourSite = T_IP;
	Buff_Tx.DesSite = 0xffff;
	Buff_Tx.Head  =	(BARCODE>>8 | BARCODE<<8);
	Buff_Tx.End =	0xBB;

	BarCode_Buff_Tx[0] = Buff_Tx.Start;
	memcpy(BarCode_Buff_Tx+1,P_Buff_Tx+2,10);		      //将Buff_Tx中的数据拷贝到BarCode_Buff_Tx中，	注意u16到u8，0x3412 变为 0x12 0x34
	memcpy(BarCode_Buff_Tx+11,Uart_Buf,RcvNUM);
	BarCode_Buff_Tx[LENGH-1] = Buff_Tx.End;
		  
