danyanshuyu/Conveying-Line/CH563_UDP_CLIENT_师兄输送线课题/User/main.c
	  len = LENGH;
	  totallen = len;
        while(1)
        {
           len = totallen;
           //CH563NET_SocketSend(SocketId,p,&len);                                 /* 将MyBuf中的数据发送 */
		   CH563NET_SocketUdpSendTo( SocketId,p,&len,ip,27000);
           totallen -= len;                                                     /* 将总长度减去以及发送完毕的长度 */
           p += len;                                                            /* 将缓冲区指针偏移*/
           if(totallen)continue;                                                /* 如果数据未发送完毕，则继续发送*/
           break;                                                               /* 发送完毕，退出 */
        }

	
}

/*******************************************************************************
* Function Name  : ResetOutput()
* Description    : 设置io全部输出
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void SetOutput(UINT32 Value)
{
	UINT32 Output_Port;	
	int Num;
	
	Output_Port = Value;
	
	
	  /*设置对应每一个开关量的值*/
		for(Num=0;Num<=21;Num++)
		{			
			if( (Output_Port>>Num & 0x00000001) == 1 )		 // 如果该信号量设置为1，则输出端无效				
			{
				if(0<=Num && Num<=3)
				R8_PD_OUT_1 |= (1<<(Num+4));					//开关量输出与GPIO引脚对应关系
				else if(Num<=11)								//OUT  21 20 19 18 17 16 15 14 13 12 11 10  9 8 7 6 5 4     3  2  1  0
				R8_PA_OUT_0 |= (1<<(Num-4));					//PA   17 16 11 10  9  8 15 14 13 12  7  6  5 4 3 2 1 0 PD 15 14 13 12 
				else if(Num<=15)								  		   
				R8_PA_OUT_1 |= (1<<(Num-8));					
				else if(Num<=19)
				R8_PA_OUT_1 |= (1<<(Num-16));
				else if(Num<=21)
				R8_PA_OUT_2 |= (1<<(Num-20));
			}
			else if((Output_Port>>Num & 0x00000001) == 0 )	 // 如果设置值为0，则对应位输出有效,即低电平有效
			{
				if(0<=Num && Num<=3)
				R8_PD_OUT_1 &= ~(1<<(Num+4));
				else if(Num<=11)
				R8_PA_OUT_0 &= ~(1<<(Num-4));
				else if(Num<=15)
				R8_PA_OUT_1 &= ~(1<<(Num-8));
				else if(Num<=19)
				R8_PA_OUT_1 &= ~(1<<(Num-16));
				else if(Num<=21)
				R8_PA_OUT_2 &= ~(1<<(Num-20));
			}
		}
}
/*******************************************************************************
* Function Name  : Data_Process
* Description    : 接收上位机的数据并处理
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/

void Data_Process()
{
    UINT16  LENGH  = ( Buff_Rx.Lengh>>8 | Buff_Rx.Lengh<<8 );		// 包长度,存储在Buff_Rx中的数据高低位已被互换了一次，这里要换回来
	UINT16  R_Head = ( Buff_Rx.Head>>8 | Buff_Rx.Head<<8 );			// 接收的报文头
	UINT16  T_Head = 0;												// 发送的报文头
	UINT16  T_IP = (IPAddr[3]>>8 | IPAddr[3]<<8);					// 发送的下位机IP的第四位
	UINT16V Input_Port = 0;							                // 该变量对应硬件中读出的开关量输入
	UINT32  Output_Port = 0x00000000;								// 该变量对应写入的开关量输出
	int i,Num,j;
	UINT8 * P_Buff_Tx = (void *)&Buff_Tx;							//定义一个指向结构体Buff_Tx起始地址的指针
	UINT16  M_Num;													//远程IO号
	UINT16  M_Data;													//远程IO值

	Buff_Tx.Start = 0xAA;
	Buff_Tx.Packet_Flag = 0x0000;
	Buff_Tx.SourSite = T_IP;
	Buff_Tx.DesSite = 0xffff;
	Buff_Tx.End = 0xBB;


    if( R_Head == PLC_Q )									        // 接受到的报文头为 PLC代码
	{	
		R8_TMR1_INTER_EN &= ~RB_TMR_IE_CYC_END;										  //失能定时器中断   
		
		Control_PLC_End = 0;                            //PLC扫描立即终止
		
		SetOutput(0xffffffff);                          //IO全部清零
				
		memset(EEPROM_CODE,0,sizeof(EEPROM_CODE));     //PLC代码缓存清空
		memset(EEPROM_BUFF,0,sizeof(EEPROM_BUFF));     //PLC寄存器缓存清空
		
		T_Head = LOWER_ANSW;
		
		CH563_EEPROM_ERASE( PLC_Code_Addr,0x1000);                              //  擦除0x0000地址开始的4K数据
		CH563_EEPROM_WRITE( PLC_Code_Addr,Buff_Rx.Data.PLC_Cmd,LENGH-12 );       //  将PLC程序写入EEPROM中，起始地址0x0000
		CH563_EEPROM_READ ( 0,EEPROM_CODE,LENGH-12 );                            //  EEPROM读取地址0x0000数据，读取LENGH-12字节到EEPROM_CODE中

		for(i=0;i<(LENGH/2-6);i++)				                                // 小端模式的u8 0x12 0x34转换u16 为0x3412，故此处要换回来
		{						  
			EEPROM_CODE[i] = (UINT16)(EEPROM_CODE[i]<<8|EEPROM_CODE[i]>>8);	
		}
    
		
		Control_PLC_End = 1;                            //PLC扫描全局控制量开启   R8_INT_EN_IRQ_0 |= RB_IE_IRQ_TMR1;                                          //开启TIM1中断 
		
		
	}
	if( R_Head == GET_IN )									        // 上位机获取开关量输入
	{	
		
		T_Head = ( GET_IN>>8 | GET_IN<<8 );
		Buff_Tx.Lengh = ( 0x000e>>8 | 0x000e<<8 );
		Buff_Tx.Head  =	T_Head;
		LENGH_TX = 14;		
		Input_Port = (UINT16)( (R8_PB_PIN_2 & 0x0F) | ((R8_PD_PIN_1<<4) & 0xF0))<<8 | (UINT16)( (R8_PD_PIN_3>>7) & 0x01 | R8_PB_PIN_0<<1 );	 
																   // 从GPIO中读出开关量的信号,PB16~19 PD8~11,PD31 PB0~6
																                              //IN     7~0   ,    15~8
		//Input_Port = 0xFF00 | ((R8_PD_PIN_0 & 0xFC)>>2);//拨码开关模块测试
		//Input_Port = 0xFF00 | ((R8_PB_PIN_1 & 0x03)<<4 | (R8_PB_PIN_1 & 0x30)<<2 | (R8_PB_PIN_1 & 0xC0)>>6 | (R8_PD_PIN_0 & 0x03)<<2);//拨码盘模块测试

		Buff_Tx.Data.IO_Data[0] = Input_Port ;
		
		FirstBuf_Tx[0] = Buff_Tx.Start;
		memcpy(FirstBuf_Tx+1,P_Buff_Tx+2,LENGH_TX-2);		      //将Buff_Tx中的数据拷贝到结构体FirstBuf_Tx中，	注意u16到u8，0x3412 变为 0x12 0x34
		FirstBuf_Tx[LENGH_TX-1] = Buff_Tx.End;
	}
	if( R_Head == SET_OUT )									        // 上位机设置开关量输出
	{																//上位机发送OUT格式 7~0,15~8,23~16,31~24(只有0~21位有效)
																	//                0x12   34   56   78
																	//储存在Buff_Rx.Data.IO_Data[0]和[1]中的格式（小端模式，高字节高地址，低字节低地址）
																	//	协议中的0x1234	-> Buff_Rx中的0x3412	-> 	协议中的0x1234	         
		T_Head =  ( SET_OUT>>8 | SET_OUT<<8 );
		Buff_Tx.Lengh = ( 0x0010>>8 | 0x0010<<8 );
		Buff_Tx.Head  =	T_Head;
		LENGH_TX = 16;
		
		R8_TMR1_INTER_EN &= ~RB_TMR_IE_CYC_END;										  //失能定时器中断   
		
		Control_PLC_End = 0;                            //PLC扫描立即终止
						
		memset(EEPROM_CODE,0,sizeof(EEPROM_CODE));     //PLC代码缓存清空
		memset(EEPROM_BUFF,0,sizeof(EEPROM_BUFF));     //PLC寄存器缓存清空
		
		T_Head = LOWER_ANSW;
		
		
		/*从上位机广播帧中找出本地IP对应IO端口Output_Port值*/
		/*
		for(i = 0;i < (LENGH-4)/6;i += 3)
		{
			if(Buff_Rx.Data.IO_Data[i] == T_IP)
			{
			    Output_Port = Buff_Rx.Data.IO_Data[i+2]<<16 | (UINT32) Buff_Rx.Data.IO_Data[i+1] ;	 
																   // 对应GPIO中要写入的开关量输出信号，OUT0~21
				break;
			}
		}
		*/
		Output_Port = Buff_Rx.Data.IO_Data[1]<<16 | (UINT32) Buff_Rx.Data.IO_Data[0] ;

		SetOutput(Output_Port);
				
