danyanshuyu/Conveying-Line/CH563_UDP_CLIENT_师兄输送线课题/User/main.c
		Buff_Tx.Data.IO_Data[0] = Buff_Rx.Data.IO_Data[0] ;
		Buff_Tx.Data.IO_Data[1] = Buff_Rx.Data.IO_Data[1] ;
		
		FirstBuf_Tx[0] = Buff_Tx.Start;
		memcpy(FirstBuf_Tx+1,P_Buff_Tx+2,LENGH_TX-2);		      //将Buff_Tx中的数据拷贝到结构体FirstBuf_Tx中，	注意u16到u8，0x3412 变为 0x12 0x34
		FirstBuf_Tx[LENGH_TX-1] = Buff_Tx.End;

	}
    if( R_Head == GET_OUT )									        // 上位机获取开关量输出
	{	
		
		T_Head = ( GET_OUT>>8 | GET_OUT<<8 );
		Buff_Tx.Lengh = ( 0x0010>>8 | 0x0010<<8 );
		Buff_Tx.Head  =	T_Head;
		LENGH_TX = 16;		
		Output_Port = 0xFFFFFFFF;
		
		for(Num=0;Num<=21;Num++)
		{
			if(*((UINT16 *)EEPROM_BUFF + Num + 0x30) == 1)
			Output_Port &= ~(1<<Num);	
		}
		Buff_Tx.Data.IO_Data[0] =  (UINT16) Output_Port;
	    Buff_Tx.Data.IO_Data[1] =  (UINT16)(Output_Port>>16) ;

	    FirstBuf_Tx[0] = Buff_Tx.Start;
		memcpy(FirstBuf_Tx+1,P_Buff_Tx+2,LENGH_TX-2);		      //将Buff_Tx中的数据拷贝到结构体FirstBuf_Tx中，	注意u16到u8，0x3412 变为 0x12 0x34
		FirstBuf_Tx[LENGH_TX-1] = Buff_Tx.End;
	
	}
	if( R_Head == SEND_IP_ID )									        // 下位机发送本地IP和ID
	{

		T_Head = ( SEND_IP_ID>>8 | SEND_IP_ID<<8 );
		Buff_Tx.Lengh = ( 0x000e>>8 | 0x000e<<8 );
	    Buff_Tx.Head  =	T_Head;
	    LENGH_TX = 14;
	
	    Buff_Tx.Data.IO_Data[0] =  (UINT16)IPAddr[3]<<8;
	    
		FirstBuf_Tx[0] = Buff_Tx.Start;
		memcpy(FirstBuf_Tx+1,P_Buff_Tx+2,LENGH_TX-2);		      //将Buff_Tx中的数据拷贝到结构体FirstBuf_Tx中，	注意u16到u8，0x3412 变为 0x12 0x34
		FirstBuf_Tx[LENGH_TX-1] = Buff_Tx.End;
		
	}
	if( R_Head == SET_MXXX )									  // 远程IO控制，接收其他控制板发来的MXXX的值，XXX为000~009
	{
		M_Num = (Buff_Rx.Data.Mxxx_Data[0]>>8 | Buff_Rx.Data.Mxxx_Data[0]<<8) ;
		M_Data = (Buff_Rx.Data.Mxxx_Data[1]>>8 | Buff_Rx.Data.Mxxx_Data[1]<<8) ;
		
		printf("SET_MXXX %d %d\n",M_Num,M_Data);
		EEPROM_BUFF[M_Num+2*0x30] = M_Data;					      
	}

	
	if( R_Head == PLC_START )									        //上位机控制全部启动
	{
		//printf("START\n");
		PLC_PowerOn_Init(); 											//由上位机控制上电初始化PLC程序
	}

	if( R_Head == PLC_STOP )									        //上位机控制全部停止
	{
		R8_TMR1_INTER_EN &= ~RB_TMR_IE_CYC_END;							//失能定时器中断   
		
		Control_PLC_End = 0;                            //PLC扫描立即终止
		
		SetOutput(0xffffffff);                          //IO全部清零
				
		memset(EEPROM_CODE,0,sizeof(EEPROM_CODE));     //PLC代码缓存清空
		memset(EEPROM_BUFF,0,sizeof(EEPROM_BUFF));     //PLC寄存器缓存清空
		
		T_Head = LOWER_ANSW;
	}
	

	if( R_Head == HANDSHAKE )
	{
		//printf("R_Head == HANDSHAKE\n");
		SendHandShake((UINT8)(Buff_Rx.Data.IP_Data[0]>>8));
	}
	
	if( R_Head == HANDSUCCESS )
	{
		//printf("R_Head == HANDSUCCESS\n");
		HandShakeSuccess();
	}
	
	
	//此处添加程序
}


/*******************************************************************************
* Function Name  : SendHandShake
* Description    : 上位机发送握手指令，使该下位机和目标下位机通信
* Input          : 目标下位机最后一位IP地址
* Output         : None
* Return         : None
*******************************************************************************/
void SendHandShake(UINT8 Last_IP)
{
	
	UINT8 a[12]= {0xAA,0x00 ,0x0C, 0x00 ,0x00 ,0xFF ,0xFF ,0xFF ,0xFF ,0x00 ,0xED ,0xBB};
	UINT32 len = 12;	
	UINT8  *p = a;
	UINT8  DES_IP[4] = {192,168,1,2};                                         //最后一位IP地址待传入
	UINT8  *ip = DES_IP;

	DES_IP[3] =	Last_IP;
	Mxxx_Des_IP_1[3] = Last_IP;
	a[5] = 0x00;
	a[6] = IPAddr[3];
	a[7] = 0x00;
    a[8] = Last_IP;

	CH563NET_SocketUdpSendTo(SocketId,p,&len,ip,28000);
	
}

/*******************************************************************************
* Function Name  : HandShakeSuccess
* Description    : 下位机发送握手成功信号，告知上位机
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void HandShakeSuccess()
{
	
	UINT8 a[12]= {0xAA,0x00 ,0x0C, 0x00 ,0x00 ,0xFF ,0xFF ,0xFF ,0xFF ,0x00 ,0xED ,0xBB};
	UINT32 len = 12;	
	UINT8  *p = a;
	UINT8  DES_IP[4] = {192,168,1,100};                                         
	UINT8  *ip = DES_IP;

	a[5] = 0x00;
	a[6] = IPAddr[3];

	CH563NET_SocketUdpSendTo(SocketId,p,&len,ip,27000);
	
}

/*******************************************************************************
* Function Name  : Reverse
* Description    : 二进制数逆序排列得到的新数
* Input          : UINT8 a 为待排序数  待排位 为0~（n-1）
* Output         : None
* Return         : None
*******************************************************************************/
UINT8 Reverse(UINT8 a,UINT8 n )                                                        
{
    UINT8 temp = 0;
	int i;
    for (i = n-1; i >= 0; i--)
    	temp |= (UINT8)(((a>>i)&0x01)<<(n-1-i));	
    return temp;
	
}

/*******************************************************************************
* Function Name  : GetLocal_IP_ID
* Description    : 获得拨码盘和拨码开关设定的IP和ID
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void GetLocal_IP_ID()                                                        
{
	IPAddr[3] = ((R8_PB_PIN_1 & 0x03)<<4 | (R8_PB_PIN_1 & 0x30)<<2 | (R8_PB_PIN_1 & 0xC0)>>6 | (R8_PD_PIN_0 & 0x03)<<2);
	ID_Number = ((R8_PD_PIN_0 & 0xFC)>>2);
	MACAddr[5] = IPAddr[3];
		
}

/*******************************************************************************
* Function Name  : PLC_PowerOn_Init()
* Description    : 用于设备重新上电时，读取EEPROM中保存的PLC代码
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void PLC_PowerOn_Init()                                                        
{
	UINT8 i;
    
	  R8_TMR1_INTER_EN &= ~RB_TMR_IE_CYC_END;										  //失能定时器中断   
		
		Control_PLC_End = 0;                            //PLC扫描立即终止
		
		SetOutput(0xffffffff);                          //IO全部清零
				
		memset(EEPROM_CODE,0,sizeof(EEPROM_CODE));     //PLC代码缓存清空
		memset(EEPROM_BUFF,0,sizeof(EEPROM_BUFF));     //PLC寄存器缓存清空
	
	
	  CH563_EEPROM_READ ( 0,EEPROM_CODE,512-4 );                                  //  EEPROM读取地址0x0000数据，读取512-4字节到EEPROM_CODE中

		for(i=0;i<(512/2-2);i++)				                                // 小端模式的u8 0x12 0x34转换u16 为0x3412，故此处要换回来
		{
			EEPROM_CODE[i] = (UINT16)(EEPROM_CODE[i]<<8|EEPROM_CODE[i]>>8);	
		}
	
