danyanshuyu/Conveying-Line/CH563_UDP_CLIENT_师兄输送线课题/User/main.c
		Control_PLC_End = 1;                            //PLC扫描全局控制量开启
    
	 R8_TMR1_INTER_EN |= RB_TMR_IE_CYC_END;										  //使能定时器中断 
}

/*******************************************************************************
* Function Name  : InitTIM1
* Description    : 初始化定时器1，及其中断配置		5ms
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void InitTIM1(void)
{
   
	  R32_TMR1_CNT_END = 0x186a0 * 5;                                             //设置为5MS定时	
  	R8_TMR1_CTRL_MOD = RB_TMR_ALL_CLEAR;   	
	  R8_TMR1_CTRL_MOD = RB_TMR_COUNT_EN;										  //定时器计数功使能    
	  R32_TMR1_COUNT = 0x00000000; 
    R8_TMR1_INTER_EN |= RB_TMR_IE_CYC_END;										  //使能定时器中断
    //R8_INT_EN_IRQ_GLOB |= RB_IE_IRQ_GLOB;                                       /* 开启IRQ全局中断 */
}


/*PD0外部中断测试*/
void IRQ_InitPD( void )	
{
    R32_PD_PU  |= 0x00000001;                                                   /* GPIO D0上拉设置，置1表示上拉 */ 
    R32_PD_DIR &= ~0x00000001;                                                  /* GPIO D0方向设置为输入 , direction: 0=in, 1=out */

			 
	R32_PD_PU  |= 0x00000002;                                                   /* GPIO D1上拉设置，置1表示上拉 */ 
    R32_PD_DIR &= ~0x00000002;                                                  /* GPIO D1方向设置为输入 , direction: 0=in, 1=out */


    R32_INT_ENABLE_PD |= 0x00000001;                                            /* GPIO D0中断使能 ： 1-使能，0-禁止 */
    R32_INT_MODE_PD   |= 0x00000001;                                            /* GPIO D0中断方式 ：1-边沿中断,0-电平中断 */      
    R32_INT_POLAR_PD  |= 0x00000001;                                            /* GPIO D0中断极性 ：1-上升沿中断/高电平，0-下降沿中断/低电平 */      
    
    R32_INT_STATUS_PD  = 0xffffffff;                                               /* 中断标志写1清零 */
    R8_INT_EN_IRQ_1   |= RB_IE_IRQ_PD;                                          /* GPIO D组中断使能 */ 
     
}


/*******************************************************************************
* Function Name  : main
* Description    : 主函数
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
int main( void ) 
{

    UINT8 i = 0,Num;

    Init_GPIO( );																//初始化GPIO
    //mInitSTDIO( );                                                              /* 为了让计算机通过串口监控演示过程 */
	Uart1_Init( 9600);
	
	InitTIM1( );																//初始化定时器1，中断周期5ms
	GetLocal_IP_ID();															//获得拨码盘和拨码开关设定的IP和ID

	//IRQ_InitPD( );

    i = CH563NET_LibInit(IPAddr,GWIPAddr,IPMask,MACAddr);                       /* 库初始化 */
    mStopIfError(i);                                                            /* 检查错误 */
   
    SysTimeInit();                                                              /* 系统定时器初始化 */
    InitSysHal();                                                               /* 初始化中断 */	
	CH563NET_CreatUdpSocket();	

#if CH563NET_DBG
    printf("CH563IPLibInit Success\n");
#endif 

	while(1)
    {
        CH563NET_MainTask();                                                    /* CH563NET库主任务函数，需要在主循环中不断调用 */
        
		if(CH563NET_QueryGlobalInt())CH563NET_HandleGlobalInt();                /* 查询中断，如果有中断，则调用全局中断处理函数 */
		
		if(PLC_Loop_Flag == 1)
		{
			Proc_plc_code();                                                     /* 每过5ms执行一次PLC扫描程序 */

			PLC_Loop_Flag = 0;
		}
		
		UDP_Buff_Process();
		
    }
}

/*********************************** endfile **********************************/



